Dlubal.DynamPro.ScalingOfModeShapesMethod
Scaling of mode shapes method.

Dlubal.DynamPro.ScalingOfModeShapesMethod.UnknownScaling
Unknown type

Dlubal.DynamPro.ScalingOfModeShapesMethod.1
Unknown type

Dlubal.DynamPro.ScalingOfModeShapesMethod.ScalingType1
|uj| = 1

Dlubal.DynamPro.ScalingOfModeShapesMethod.ScalingType2
max(ux, uy, uz) = 1

Dlubal.DynamPro.ScalingOfModeShapesMethod.ScalingType3
max(ux, uy, uz, phix, phiy, phiz) = 1

Dlubal.DynamPro.ScalingOfModeShapesMethod.ScalingType4
(uj)^T*[M]*(uj) = 1